In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import display

In [6]:
a = pd.Series([4, 7, -5, 3])
print(a.index)
print(a.values) # numpy 배열
type(a.values)

a = pd.Series(a.values, ['d', 'b', 'a', 'c'])
print(a.index)
print(a['b'])

print('a' in a) # in은 인덱스에 대해 조사

RangeIndex(start=0, stop=4, step=1)
[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')
7
True

In [16]:
print(pd.isnull(a))
print(pd.notnull(a))

d    False
b    False
a    False
c    False
dtype: bool
d    True
b    True
a    True
c    True
dtype: bool

In [21]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
print(obj3)

print(pd.Series(sdata).reindex(['California', 'Ohio', 'Oregon', 'Texas']))

# 딕셔너리로 Series 만들면 key들이 index가 됨, 이 때 index 별도 지정해주면 reindex 처럼 작동
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
print(obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
display(frame)
"state" in frame        # in - 데이터프레임에서는 컬럼에 대해 조사

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

True

In [9]:
x = pd.DataFrame(data, columns=['year', 'state', 'pop'], index=['one', 'two', 'three', 'four',
                             'five', 'six'])    # 딕셔너리로 만들며 컬럼 설정 -> 컬럼 위치 재설정
display(x)

print(x[['state', 'pop', 'year']])
x = x[['state', 'pop', 'year']] # 컬럼 위치 교환
display(x)
x = x.reindex(columns=['state', 'year', 'pop'])
display(x)

# x.columns = ['year', 'state', 'pop']  # 컬럼 이름만 변경
print(x.columns)
print(x.index)
display(x)

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

        state  pop  year
one      Ohio  1.5  2000
two      Ohio  1.7  2001
three    Ohio  3.6  2002
four   Nevada  2.4  2001
five   Nevada  2.9  2002
six    Nevada  3.2  2003

        state  pop  year
one      Ohio  1.5  2000
two      Ohio  1.7  2001
three    Ohio  3.6  2002
four   Nevada  2.4  2001
five   Nevada  2.9  2002
six    Nevada  3.2  2003

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

Index(['state', 'year', 'pop'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [77]:
print(x.iloc[3])    # 행을 인덱스 숫자로 접근
print(x.loc['four'])    # 행을 인덱스 이름으로 접근

state    Nevada
pop         2.4
year       2001
Name: four, dtype: object
state    Nevada
pop         2.4
year       2001
Name: four, dtype: object

In [78]:
a = pd.Series([1.2, 1.5, 1.7], index=['two', 'four', 'five'])
display(x)
x['pop'] = a  # 시리즈를 이용해 특정 컬럼 값 지정도 가능
display(x)

        state  pop  year
one      Ohio  1.5  2000
two      Ohio  1.7  2001
three    Ohio  3.6  2002
four   Nevada  2.4  2001
five   Nevada  2.9  2002
six    Nevada  3.2  2003

        state  pop  year
one      Ohio  NaN  2000
two      Ohio  1.2  2001
three    Ohio  NaN  2002
four   Nevada  1.5  2001
five   Nevada  1.7  2002
six    Nevada  NaN  2003

In [79]:
x.loc['two'] = ['asdf', 1.1, 2000]
display(x)

        state  pop  year
one      Ohio  NaN  2000
two      asdf  1.1  2000
three    Ohio  NaN  2002
four   Nevada  1.5  2001
five   Nevada  1.7  2002
six    Nevada  NaN  2003

In [83]:
x['a'] = (x['year'] == 2000)    # 새 컬럼 추가
display(x)
del x['a']
display(x)  # 컬럼 제거

        state  pop  year      a
one      Ohio  NaN  2000   True
two      asdf  1.1  2000   True
three    Ohio  NaN  2002  False
four   Nevada  1.5  2001  False
five   Nevada  1.7  2002  False
six    Nevada  NaN  2003  False

        state  pop  year
one      Ohio  NaN  2000
two      asdf  1.1  2000
three    Ohio  NaN  2002
four   Nevada  1.5  2001
five   Nevada  1.7  2002
six    Nevada  NaN  2003

In [94]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'd', 'c'])
print(obj)
print(obj['b':'c'])

a    0.0
b    1.0
d    2.0
c    3.0
dtype: float64
b    1.0
d    2.0
c    3.0
dtype: float64

In [138]:
a = pd.DataFrame(np.arange(16).reshape(4, 4), index=[1, 2, 3, 4], columns=['a', 'b', 'c', 'd'])
display(a)

x = lambda x: x + 3
display(a.apply(x)) # 열 단위 적용 (이 경우는 요소 직접 적용과 같음(열 + 3이 브로드캐스팅됨))

x = lambda x: '%.2f' % x
a.applymap(x)  # 요소별로 함수 직접 적용

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

    a   b   c   d
1   3   4   5   6
2   7   8   9  10
3  11  12  13  14
4  15  16  17  18

       a      b      c      d
1   0.00   1.00   2.00   3.00
2   4.00   5.00   6.00   7.00
3   8.00   9.00  10.00  11.00
4  12.00  13.00  14.00  15.00

In [10]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
display(frame)
display(frame.sort_index()) # 인덱스로 정렬, 객체 자체에는 적용 x
display(frame.sort_index(axis=1))   # 컬럼으로 정렬

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [144]:
display(frame.idxmax())
display(frame.describe())

d    one
a    one
b    one
c    one
dtype: object

              d         a         b         c
count  2.000000  2.000000  2.000000  2.000000
mean   2.000000  3.000000  4.000000  5.000000
std    2.828427  2.828427  2.828427  2.828427
min    0.000000  1.000000  2.000000  3.000000
25%    1.000000  2.000000  3.000000  4.000000
50%    2.000000  3.000000  4.000000  5.000000
75%    3.000000  4.000000  5.000000  6.000000
max    4.000000  5.000000  6.000000  7.000000